c/3rd-libs/cmockery.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 四 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cmockery</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">cmockery</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7b18612">1. 概述</a></li>
<li><a href="#org0d41b50">2. 动机</a></li>
<li><a href="#org07f32d0">3. 安装</a></li>
<li><a href="#orgd3398f9">4. 使用</a>
<ul>
<li><a href="#orge2f8507">4.1. 执行测试</a></li>
<li><a href="#org3639ccf">4.2. 处理异常</a></li>
<li><a href="#orgd3a6960">4.3. 失效条件</a></li>
<li><a href="#orgcfe271f">4.4. 断言(assertions)</a></li>
<li><a href="#org036c28b">4.5. 断言宏(assert macros)</a></li>
<li><a href="#org9875b0e">4.6. 动态内存分配(dynamic memory allcation)</a></li>
<li><a href="#orgf2d58dc">4.7. Mock 函数(mock functions)</a></li>
<li><a href="#org0764f45">4.8. 返回值(return values)</a></li>
<li><a href="#orgee81b0b">4.9. 检查参数(check params)</a></li>
<li><a href="#orgf890c2c">4.10. Test State</a></li>
<li><a href="#orgabd6506">4.11. 示例（example）</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7b18612" class="outline-2">
<h2 id="org7b18612"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
cmockery 是一个轻量级库，用于创建 C 单元测试。
</p>

<p>
<a href="https://github.com/google/cmockery">cmockery</a> 测试用例被编译为独立的可执行文件，并与 cmockery 库，标准 C 库和正在被测试模块链接。在测试应用程序中，被测模块外部的任何符号都应该被模拟，替换为返回测试确定的值的函数。尽管代码模块的最终执行环境与测试环境之间可能存在显着差异，但单元测试仍然有效，因为其目标是在功能级别测试代码模块的逻辑，而不是它与目标执行环境的所有交互。
</p>

<p>
如果不进行一些修改，可能无法将测试模块编译到测试应用程序中;因此，应该在编译 Cmockery 单元测试应用程序时定义预处理程序符号 <code>UNIT_TESTING</code> ，以便模块中的代码可以针对测试进行编译。
</p>
</div>
</div>


<div id="outline-container-org0d41b50" class="outline-2">
<h2 id="org0d41b50"><span class="section-number-2">2</span> 动机</h2>
<div class="outline-text-2" id="text-2">
<p>
有多种 C 单元测试框架可供使用。但是，其中许多都相当复杂，需要最新的编译器技术。一些开发需要使用旧的编译器，这使得使用某些单元测试框架变得困难。此外，许多单元测试框架都假设要测试的代码是针对最终将执行测试的同一平台的应用程序或模块。由于这个假设，许多框架要求在要测试的代码模块中包括标准 C 库标头，这可能与被测试代码使用的 C 库的自定义或不完整实现相冲突。
</p>

<p>
Cmockery 仅需要将测试应用程序与标准 C 库链接即可，这样可以最大程度地减少与标准 C 库标头的冲突。另外，Cmockery 尝试避免使用 C 编译器的某些较新功能。
</p>

<p>
这导致 Cmockery 是一个相对较小的库，可用于测试各种外来代码。如果开发人员希望使用最新的编译器简单地测试应用程序，则最好使用其他单元测试框架。
</p>
</div>
</div>

<div id="outline-container-org07f32d0" class="outline-2">
<h2 id="org07f32d0"><span class="section-number-2">3</span> 安装</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh">git clone git@github.com:google/cmockery.git
./configure &amp;&amp; make &amp;&amp; sudo make install &amp;&amp; sudo ldconfig
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3398f9" class="outline-2">
<h2 id="orgd3398f9"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<p>
有关使用 cmockery 编写测试的机制的更多详细信息，请参阅 <a href="https://github.com/google/cmockery/blob/master/docs/user_guide.md">docs/user_guide.md</a>.
</p>
</div>

<div id="outline-container-orge2f8507" class="outline-3">
<h3 id="orge2f8507"><span class="section-number-3">4.1</span> 执行测试</h3>
<div class="outline-text-3" id="text-4-1">
<p>
单元测试用例是签名为 <code>void function(void **state)</code> 的函数。 Cmockery 测试应用程序中需要一个表，测试用例函数指针通过 <code>unit_test*()</code> 宏初始化为一个表项，然后将该表传递给 <code>run_tests()</code> 宏以执行测试。
</p>

<p>
<code>run_tests()</code> 在运行每个测试功能之前会设置适当的异常/信号处理程序和其他数据结构。单元测试完成后， <code>run_tests()</code> 执行各种检查以确定测试是否成功。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/tree/master/c/cmockery">overview.c</a>
</p>
</div>
</div>

<div id="outline-container-org3639ccf" class="outline-3">
<h3 id="org3639ccf"><span class="section-number-3">4.2</span> 处理异常</h3>
<div class="outline-text-3" id="text-4-2">
<p>
在 <code>run_tests()</code> 执行测试函数之前，异常/信号处理程序将被另外的处理程序覆盖，该程序仅显示错误并在发生异常时退出测试函数。如果在测试函数之外（例如在 Cmockery 本身中）发生异常，则应用程序将中止执行并返回错误代码。
</p>
</div>
</div>

<div id="outline-container-orgd3a6960" class="outline-3">
<h3 id="orgd3a6960"><span class="section-number-3">4.3</span> 失效条件</h3>
<div class="outline-text-3" id="text-4-3">
<p>
如果 <code>run_tests()</code> 执行的测试函数时发生故障，则该测试函数将中止，并且应用程序的继续执行下一个测试函数。
</p>

<p>
测试失败最终通过 Cmockery 函数 <code>fail()</code> 发出信号。以下事件将导致 Cmockery 库发出测试失败的信号：
</p>
<ul class="org-ul">
<li>断言(assertions)</li>
<li>异常(exception)</li>
<li>内存泄漏（memery leaks）</li>
<li>set-up 和 tear-down 函数不匹配</li>
<li>缺少 mock 返回值</li>
<li>未使用的 mock 返回值</li>
<li>预期参数值</li>
<li>未使用的期望参数值</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfe271f" class="outline-3">
<h3 id="orgcfe271f"><span class="section-number-3">4.4</span> 断言(assertions)</h3>
<div class="outline-text-3" id="text-4-4">
<p>
像标准 C 库的 assert()这样的运行时断言宏应在正在测试的模块中重新定义，以使用 Cmockery 的 <code>mock_assert()</code> 函数。通常， <code>mock_assert()</code> 表示测试失败。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/cmockery/assert.c">assert.c</a>
</p>

<p>
如果使用 <code>expect_assert_failure()</code> 宏调用了一个函数，则该函数内对 <code>mock_assert()</code> 的任何调用都将导致测试的执行。如果在通过 <code>expect_assert_failure()</code> 调用的函数期间未发生对 <code>mock_assert()</code> 的调用，则表明测试失败。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/cmockery/expect_assert_failure.c">expect_assert_failure.c</a>
</p>
</div>
</div>

<div id="outline-container-org036c28b" class="outline-3">
<h3 id="org036c28b"><span class="section-number-3">4.5</span> 断言宏(assert macros)</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Cmockery 提供了各种断言宏，测试应优先使用这些断言宏，而不是 C 标准库的 <code>assert()</code> 宏。在断言失败时，Cmockery 断言宏会将故障写入标准错误流，并发出测试失败的信号。由于 C 语言的限制，一般的 C 标准库 <code>assert()</code> 和 Cmockery 的 <code>assert_true()</code> 和 <code>assert_false()</code> 宏只能显示导致断言失败的表达式。 Cmockery 的特定于类型的断言宏 <code>assert_{type}_equal()</code> 和 <code>assert_{type}_not_equal()</code>  显示导致断言失败的数据，该数据增加了数据可见性，有助于调试失败的测试用例。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/cmockery/assert_macro.c">assert_macro.c</a>
</p>
</div>
</div>

<div id="outline-container-org9875b0e" class="outline-3">
<h3 id="org9875b0e"><span class="section-number-3">4.6</span> 动态内存分配(dynamic memory allcation)</h3>
<div class="outline-text-3" id="text-4-6">
<p>
为了测试内存泄漏，缓冲区溢出和下溢，由 Cmockery 测试的模块应该分别用 <code>test_malloc()</code> ， <code>test_calloc()</code> 和 <code>test_free()</code> 替换对 <code>malloc()</code> ， <code>calloc()</code> 和 <code>free()</code> 的调用。每次使用 <code>test_free()</code> 释放一个块时，都会检查其是否损坏。如果发现损坏的块，则表明测试失败。使用 <code>test_*()</code> 分配函数分配的所有块均由 Cmockery 库跟踪。测试完成后，如果剩余任何分配的块（内存泄漏），则将报告它们并发出测试失败的信号。
</p>

<p>
为简单起见，Cmockery 当前在一个过程中执行所有测试。因此，测试应用程序中的所有测试用例共享一个地址空间，这意味着单个测试用例的内存损坏可能会导致测试应用程序过早退出。
</p>
</div>
</div>

<div id="outline-container-orgf2d58dc" class="outline-3">
<h3 id="orgf2d58dc"><span class="section-number-3">4.7</span> Mock 函数(mock functions)</h3>
<div class="outline-text-3" id="text-4-7">
<p>
理想情况下，单元测试应将要测试的函数或模块与任何外部依赖项隔离开。可以通过将被测试模块与模拟函数静态或动态链接来达到目的。当要测试的代码直接引用外部函数时，模拟函数必须静态链接。在被测试模块使用的表中设置函数指针以引用单元测试中定义的模拟函数时才会用到动态链接。
</p>
</div>
</div>

<div id="outline-container-org0764f45" class="outline-3">
<h3 id="org0764f45"><span class="section-number-3">4.8</span> 返回值(return values)</h3>
<div class="outline-text-3" id="text-4-8">
<p>
为了简化模拟函数的实现，Cmockery 通过 <code>will_return()</code> 在每个测试用例中存储模拟函数的返回值。然后，每个模拟函数都调用 <code>mock()</code> 返回这些值。
</p>

<p>
传递给 <code>will_return()</code> 的值将添加到每个函数指定的队列中。函数每次对 <code>mock()</code> 的连续调用都会从队列中删除一个返回值。这使得模拟函数可以使用多次调用 <code>mock()</code> 来返回输出参数以及返回值。另外，这允许指定多次调用模拟函数的返回值。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/cmockery/mock_func.c">mock_func.c</a>
</p>
</div>
</div>

<div id="outline-container-orgee81b0b" class="outline-3">
<h3 id="orgee81b0b"><span class="section-number-3">4.9</span> 检查参数(check params)</h3>
<div class="outline-text-3" id="text-4-9">
<p>
除了存储模拟函数的返回值外，Cmockery 还使用 <code>expect_*()</code> 函数存储模拟函数参数的期望值。然后可以使用 <code>=check_expected()</code> = 宏来验证模拟函数参数。
</p>

<p>
对参数的 <code>expect_*()</code> 宏的连续调用将检查指定的参数的值排队。 <code>check_expected()</code> 根据使用 <code>expected_*()</code> 排队的下一个值检查功能参数，如果参数检查失败，则表示测试失败。此外，如果调用 <code>check_expected()</code> 且没有更多的参数值排队，则测试失败。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/cmockery/mock_func_param.c">mock_func_param.c</a>
</p>
</div>
</div>

<div id="outline-container-orgf890c2c" class="outline-3">
<h3 id="orgf890c2c"><span class="section-number-3">4.10</span> Test State</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Cmockery 允许为每个测试用例指定多种 set-up 和 tear-down 功能。由 <code>unit_test_setup()</code> 或 <code>unit_test_setup_teardown()</code> 宏指定的 set-up 函数允许在多个测试用例之间共享常见的初始化。另外，由 unit_test_teardown()或 <code>unit_test_setup_teardown()</code> 宏指定的 tear-down 函数提供了即使在测试用例失败时也始终执行的代码路径。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/cmockery/setup_teardown.c">setup_teardown.c</a>
</p>
</div>
</div>
<div id="outline-container-orgabd6506" class="outline-3">
<h3 id="orgabd6506"><span class="section-number-3">4.11</span> 示例（example）</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 17:00</p>
<p class="validation"></p>
</div>
</body>
</html>
